import cliSpinners from "cli-spinners";


console.log(cliSpinners.dots);
Beispiel: dots
/*
"dots":
{
	"interval": 80,
	"frames": ['⠋', '⠙', '⠹', '⠸', '⠼', '⠴', '⠦', '⠧', '⠇', '⠏']
}
*/

/* "clock": {
  "interval": 100,
  "frames": [
    "🕛 ",
    "🕐 ",
    "🕑 ",
    "🕒 ",
    "🕓 ",
    "🕔 ",
    "🕕 ",
    "🕖 ",
    "🕗 ",
    "🕘 ",
    "🕙 ",
    "🕚 "
  ]
 */

/* "arrow2": {
  "interval": 80,
  "frames": [
    "⬆️ ",
    "↗️ ",
    "➡️ ",
    "↘️ ",
    "⬇️ ",
    "↙️ ",
    "⬅️ ",
    "↖️ "
  ] */


/* "smiley": {
  "interval": 200,
  "frames": [
    "😄 ",
    "😝 "
  ]
},

"monkey": {
  "interval": 300,
  "frames": [
    "🙈 ",
    "🙈 ",
    "🙉 ",
    "🙊 "
  ] */


/* "earth": {
  "interval": 180,
  "frames": [
    "🌍 ",
    "🌎 ",
    "🌏 "
  ]
 */

/* 	"moon": {
		"interval": 80,
		"frames": [
			"🌑 ",
			"🌒 ",
			"🌓 ",
			"🌔 ",
			"🌕 ",
			"🌖 ",
			"🌗 ",
			"🌘 "
		]
	},
	"runner": {
		"interval": 140,
		"frames": [
			"🚶 ",
			"🏃 "
		] */



/* 
"weather": {
  "interval": 100,
  "frames": [
    "☀️ ",
    "☀️ ",
    "☀️ ",
    "🌤 ",
    "⛅️ ",
    "🌥 ",
    "☁️ ",
    "🌧 ",
    "🌨 ",
    "🌧 ",
    "🌨 ",
    "🌧 ",
    "🌨 ",
    "⛈ ",
    "🌨 ",
    "🌧 ",
    "🌨 ",
    "☁️ ",
    "🌥 ",
    "⛅️ ",
    "🌤 ",
    "☀️ ",
    "☀️ "
  ] */


/* "squareCorners": {
  "interval": 180,
  "frames": [
    "◰",
    "◳",
    "◲",
    "◱"
  ] */

  

/* 	"christmas": {
		"interval": 400,
		"frames": [
			"🌲",
			"🎄"
		] */

/* 	"fingerDance": {
		"interval": 160,
		"frames": [
			"🤘 ",
			"🤟 ",
			"🖖 ",
			"✋ ",
			"🤚 ",
			"👆 "
		]
 */

/* 	"soccerHeader": {
		"interval": 80,
		"frames": [
			" 🧑⚽️       🧑 ",
			"🧑  ⚽️      🧑 ",
			"🧑   ⚽️     🧑 ",
			"🧑    ⚽️    🧑 ",
			"🧑     ⚽️   🧑 ",
			"🧑      ⚽️  🧑 ",
			"🧑       ⚽️🧑  ",
			"🧑      ⚽️  🧑 ",
			"🧑     ⚽️   🧑 ",
			"🧑    ⚽️    🧑 ",
			"🧑   ⚽️     🧑 ",
			"🧑  ⚽️      🧑 "
		]

 */

/* 	"mindblown": {
		"interval": 160,
		"frames": [
			"😐 ",
			"😐 ",
			"😮 ",
			"😮 ",
			"😦 ",
			"😦 ",
			"😧 ",
			"😧 ",
			"🤯 ",
			"💥 ",
			"✨ ",
			"\u3000 ",
			"\u3000 ",
			"\u3000 "
		]
 */

/*   "orangePulse": {
		"interval": 100,
		"frames": [
			"🔸 ",
			"🔶 ",
			"🟠 ",
			"🟠 ",
			"🔶 "
		] */

/*     "pipe": {
      "interval": 100,
      "frames": [
        "┤",
        "┘",
        "┴",
        "└",
        "├",
        "┌",
        "┬",
        "┐"
      ] */